Imports

In [1]:
import pandas as pd
import numpy as np

For this project I want to start with loading in a
dataframe that measures the total amount of 
pregnancies and the total amount of births in 
each state in the United States.

In [3]:
df = pd.read_csv('data_files/total_pregnancies.csv')
df.head()

,measure_name,datum,state_id,state_name,first_year,last_year,footnotes,sources
0,No. of pregnancies ending in birth,10445,AK,Alaska,2017,NaN,NaN,"Maddow-Zimet I and Kost K, <i>Pregnancies, Bir..."
1,No. of pregnancies ending in birth,58941,AL,Alabama,2017,NaN,NaN,"Maddow-Zimet I and Kost K, <i>Pregnancies, Bir..."
2,No. of pregnancies ending in birth,37520,AR,Arkansas,2017,NaN,NaN,"Maddow-Zimet I and Kost K, <i>Pregnancies, Bir..."
3,No. of pregnancies ending in birth,81872,AZ,Arizona,2017,NaN,NaN,"Maddow-Zimet I and Kost K, <i>Pregnancies, Bir..."
4,No. of pregnancies ending in birth,471658,CA,California,2017,NaN,NaN,"Maddow-Zimet I and Kost K, <i>Pregnancies, Bir..."

So there a couple problems with this Dataframe.
1. I want to change the name of column state_id to state_abrv (x)
2. I want to delete the first_year, last_year, footnotes, and sources columns because they are not useful to the project. (x)
3. The measure_name column identifies what our datum column is measuring. It also measures two different variables. I want the variables split into two dataframes.
4. I want to rename the datum column in each dataframe to "total_births" and "total_pregnancies".
5. I want to extract the "total_pregnancies" column from the second data frame and combine it with the first data frame.
6. I want to delete the measure_name column from each dataframe.
7. I want the index of my dataframes to make the data easy to identify. The best solution is to make the state_abrv column the index.
8. I want to move my state_name column next to my state_abrv index for clarity in grouping.

In [4]:
# Renaming the state_id column.
df.rename(columns={'state_id':'state_abrv'}, inplace=True)
df.head()

,measure_name,datum,state_abrv,state_name,first_year,last_year,footnotes,sources
0,No. of pregnancies ending in birth,10445,AK,Alaska,2017,NaN,NaN,"Maddow-Zimet I and Kost K, <i>Pregnancies, Bir..."
1,No. of pregnancies ending in birth,58941,AL,Alabama,2017,NaN,NaN,"Maddow-Zimet I and Kost K, <i>Pregnancies, Bir..."
2,No. of pregnancies ending in birth,37520,AR,Arkansas,2017,NaN,NaN,"Maddow-Zimet I and Kost K, <i>Pregnancies, Bir..."
3,No. of pregnancies ending in birth,81872,AZ,Arizona,2017,NaN,NaN,"Maddow-Zimet I and Kost K, <i>Pregnancies, Bir..."
4,No. of pregnancies ending in birth,471658,CA,California,2017,NaN,NaN,"Maddow-Zimet I and Kost K, <i>Pregnancies, Bir..."

In [5]:
# Deleting columns that are not useful.
df.drop(columns=['first_year', 'last_year', 'footnotes', 'sources'], inplace=True)
df.head()

                         measure_name   datum state_abrv  state_name
0  No. of pregnancies ending in birth   10445         AK      Alaska
1  No. of pregnancies ending in birth   58941         AL     Alabama
2  No. of pregnancies ending in birth   37520         AR    Arkansas
3  No. of pregnancies ending in birth   81872         AZ     Arizona
4  No. of pregnancies ending in birth  471658         CA  California

In [6]:
# Creating two dataframes.
df1 = df.iloc[0:50,:].copy()
df2 = df.iloc[50:,:].copy()

In [7]:
df1.head()

                         measure_name   datum state_abrv  state_name
0  No. of pregnancies ending in birth   10445         AK      Alaska
1  No. of pregnancies ending in birth   58941         AL     Alabama
2  No. of pregnancies ending in birth   37520         AR    Arkansas
3  No. of pregnancies ending in birth   81872         AZ     Arizona
4  No. of pregnancies ending in birth  471658         CA  California

In [8]:
df2.head()

,measure_name,datum,state_abrv,state_name
50,Total no. of pregnancies among women aged 15-44,14090,AK,Alaska
51,Total no. of pregnancies among women aged 15-44,79150,AL,Alabama
52,Total no. of pregnancies among women aged 15-44,49110,AR,Arkansas
53,Total no. of pregnancies among women aged 15-44,112840,AZ,Arizona
54,Total no. of pregnancies among women aged 15-44,710510,CA,California

In [9]:
# Renaming "datum" in each dataframe to "total_births" and "total_pregnancies".
df1.rename(columns={'datum':'total_births'}, inplace=True)
df2.rename(columns={'datum':'total_pregnancies'}, inplace=True)

In [10]:
df1.head()

                         measure_name  total_births state_abrv  state_name
0  No. of pregnancies ending in birth         10445         AK      Alaska
1  No. of pregnancies ending in birth         58941         AL     Alabama
2  No. of pregnancies ending in birth         37520         AR    Arkansas
3  No. of pregnancies ending in birth         81872         AZ     Arizona
4  No. of pregnancies ending in birth        471658         CA  California

In [11]:
df2.head()

,measure_name,total_pregnancies,state_abrv,state_name
50,Total no. of pregnancies among women aged 15-44,14090,AK,Alaska
51,Total no. of pregnancies among women aged 15-44,79150,AL,Alabama
52,Total no. of pregnancies among women aged 15-44,49110,AR,Arkansas
53,Total no. of pregnancies among women aged 15-44,112840,AZ,Arizona
54,Total no. of pregnancies among women aged 15-44,710510,CA,California

In [12]:
# Resetting index to 0:49 instead of 50:99 in a new dataframe.
df3 = df2['total_pregnancies'].reset_index()
df3.head()

   index  total_pregnancies
0     50              14090
1     51              79150
2     52              49110
3     53             112840
4     54             710510

In [13]:
# Dropping the new index column
df3.drop(columns='index', inplace=True)
df3.head()

   total_pregnancies
0              14090
1              79150
2              49110
3             112840
4             710510

In [14]:
# Adding the 'total_pregnancies' column to the first dataframe.
df1['total_pregnancies'] = df3['total_pregnancies'].copy()
df1.head()

,measure_name,total_births,state_abrv,state_name,total_pregnancies
0,No. of pregnancies ending in birth,10445,AK,Alaska,14090
1,No. of pregnancies ending in birth,58941,AL,Alabama,79150
2,No. of pregnancies ending in birth,37520,AR,Arkansas,49110
3,No. of pregnancies ending in birth,81872,AZ,Arizona,112840
4,No. of pregnancies ending in birth,471658,CA,California,710510

In [15]:
# Dropping the 'measure_name' column
df1.drop(columns='measure_name', inplace=True)
df1.head()

   total_births state_abrv  state_name  total_pregnancies
0         10445         AK      Alaska              14090
1         58941         AL     Alabama              79150
2         37520         AR    Arkansas              49110
3         81872         AZ     Arizona             112840
4        471658         CA  California             710510

In [16]:
# Setting index to state abreviations.
df1.set_index(['state_abrv'], inplace=True)
df1.head()

            total_births  state_name  total_pregnancies
state_abrv
AK                 10445      Alaska              14090
AL                 58941     Alabama              79150
AR                 37520    Arkansas              49110
AZ                 81872     Arizona             112840
CA                471658  California             710510